IRP/src/Catalogs/ReportOptions/ReportOptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ReportOptions</name>
  <attributes>
    <name>ObjectKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Option</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

IRP/src/SettingsStorages/ReportOptions/ManagerModule.bsl
Procedure SaveProcessing(ObjectKey, SettingsKey, Settings, SettingsDescription, User)	
	Option = New ValueStorage(Settings, New Deflation(9));	
	ReportOptionRef = Catalogs.ReportOptions.FindByCode(SettingsKey);
	ReportOptionObj = ReportOptionRef.GetObject();
	ReportOptionObj.Option = Option;
	ReportOptionObj.Write();		
EndProcedure

Procedure LoadProcessing(ObjectKey, SettingsKey, Settings, SettingsDescription, User)
	ReportOption = Catalogs.ReportOptions.FindByCode(SettingsKey);
	Settings = ReportOption.Option;
	If SettingsDescription <> Undefined Then
		SettingsDescription.Presentation = ReportOption.Description;
	EndIf;
EndProcedure
